// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   HexeditStrings.uni 
// 
// Abstract:
// 
//   String definitions for the Shell hexedit command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_HEXEDIT_USAGE                 #language eng  "\n\n    %EHexEditor Usage%N\n"

#string STR_HEXEDIT_FILENAME              #language eng  "    %H[-f] Filename%N                                 Open File For Editing\n"

#string STR_HEXEDIT_DISKNAME              #language eng  "    %H-d   DiskName FirstBlockNo.   BlockNumber%N     Open Disk Block For Editing\n"

#string STR_HEXEDIT_OFFSET_SIZE           #language eng  "    %H-m   Offset   Size%N                            Open Memory Region For Editing\n"

#string STR_HEXEDIT_FILE_NAME             #language eng  "%Hhexedit%N: Invalid File Name\n"

#string STR_HEXEDIT_LIBEDITOR_MAINEDITOR_TITLE      #language eng  "%EMainEditor init failed on TitleBar init\n%N"			

#string STR_HEXEDIT_LIBEDITOR_MAINEDITOR_MAINMENU   #language eng  "%EMainEditor init failed on MainMenu init\n%N"

#string STR_HEXEDIT_LIBEDITOR_MAINEDITOR_STATUS     #language eng  "%EMainEditor init failed on StatusBar init\n%N"

#string STR_HEXEDIT_LIBEDITOR_MAINEDITOR_INPUTBAR   #language eng  "%EMainEditor init failed on InputBar init\n%N"

#string STR_HEXEDIT_LIBEDITOR_MAINEDITOR_BUFFERIMAGE  #language eng  "%EMainEditor init failed on BufferImage init\n%N"

#string STR_HEXEDIT_LIBEDITOR_MAINEDITOR_CLIPBOARD    #language eng  "%EMainEditor init failed on ClipBoard init\n%N"

#string STR_HEXEDIT_LIBEDITOR_TITLEBAR_CLEAN      #language eng  "TitleBar cleanup failed\n"

#string STR_HEXEDIT_LIBEDITOR_MENUBAR_CLEAN       #language eng  "MenuBar cleanup failed\n"

#string STR_HEXEDIT_LIBEDITOR_STATUSBAR_CLEAN     #language eng  "StatusBar cleanup failed\n"

#string STR_HEXEDIT_LIBEDITOR_INPUTBAR_CLEAN      #language eng  "InputBar cleanup failed\n"

#string STR_HEXEDIT_LIBEDITOR_BUFFERIMAGE_CLEAN   #language eng  "BufferImage cleanup failed\n"

#string STR_HEXEDIT_LIBEDITOR_CLIPBOARD_CLEAN     #language eng  "ClipBoard cleanup failed\n"

#string STR_HEXEDIT_LIBINPUTBAR_MAININPUTBAR      #language eng  "%s"

#string STR_HEXEDIT_LIBMENUBAR_OPEN_FILE          #language eng  "Open File"

#string STR_HEXEDIT_LIBMENUBAR_OPEN_DISK          #language eng  "Open Disk"

#string STR_HEXEDIT_LIBMENUBAR_OPEN_MEMORY        #language eng  "Open Memory"

#string STR_HEXEDIT_LIBMENUBAR_SAVE_BUFFER        #language eng  "Save Buffer"

#string STR_HEXEDIT_LIBMENUBAR_SELECT_START       #language eng  "Select Start"

#string STR_HEXEDIT_LIBMENUBAR_SELECT_END         #language eng  "Select End"

#string STR_HEXEDIT_LIBMENUBAR_CUT                #language eng  "Cut"

#string STR_HEXEDIT_LIBMENUBAR_PASTE              #language eng  "Paste"

#string STR_HEXEDIT_LIBMENUBAR_GO_TO_OFFSET       #language eng  "Go To Offset"

#string STR_HEXEDIT_LIBMENUBAR_EXIT         #language eng  "Exit"

#string STR_HEXEDIT_LIBMENUBAR_F1           #language eng  "F1"

#string STR_HEXEDIT_LIBMENUBAR_F2           #language eng  "F2"

#string STR_HEXEDIT_LIBMENUBAR_F3           #language eng  "F3"

#string STR_HEXEDIT_LIBMENUBAR_F4           #language eng  "F4"

#string STR_HEXEDIT_LIBMENUBAR_F5           #language eng  "F5"

#string STR_HEXEDIT_LIBMENUBAR_F6           #language eng  "F6"

#string STR_HEXEDIT_LIBMENUBAR_F7           #language eng  "F7"

#string STR_HEXEDIT_LIBMENUBAR_F8           #language eng  "F8"

#string STR_HEXEDIT_LIBMENUBAR_F9           #language eng  "F9"

#string STR_HEXEDIT_LIBMENUBAR_F10          #language eng  "F10"

#string STR_HEXEDIT_LIBTITLEBAR_MAINEDITOR         #language eng  "%s"

#string STR_HEXEDIT_LIBTITLEBAR_MAINEDITOR_C       #language eng  "%c"

#string STR_HEXEDIT_LIBTITLEBAR_MAINEDITOR_TWOVARS    #language eng  "( %X ~ %X )  "

#string STR_HEXEDIT_LIBTITLEBAR_FILE          #language eng  "   [FILE]"

#string STR_HEXEDIT_LIBTITLEBAR_DISK          #language eng  "   [DISK]"

#string STR_HEXEDIT_LIBTITLEBAR_MEM           #language eng  "    [MEM]"

#string STR_HEXEDIT_INIT_FAILED               #language eng  "%Hhexedit%N: Initialization Failed\n"

#string STR_HEXEDIT_ONE_VAR                   #language eng  "%Hhexedit%N: %s\n"

#string STR_HEXEDIT_UNKNOWN_EDITOR            #language eng  "%Hhexedit%N: Unknown Editor Error\n"

#string STR_HEXEDIT_NOREDIRECT                #language eng  "%Hhexedit%N: Redirection  are not allowed\n"

#string STR_HEXEDIT_LINE_HELP        #language eng  "Full screen hex editor"

#string STR_HEXEDIT_VERBOSE_HELP     #language eng  "Full screen hex editor for files, block devices, or memory.\n"
                                                      "\n"
                                                      "HEXEDIT [[-f] FileName | [-d DiskName Offset Size] | [-m Address Size]]\n"
                                                      "\n"
                                                      "    -f      - Name of file to edit\n"
                                                      "    -d      - Disk block to edit:\n"
                                                      "                DiskName - Name of disk to edit (for example fs0)\n"
                                                      "                Offset   - Starting block number (beginning from 0)\n"
                                                      "                Size     - Number of blocks to be edited\n"
                                                      "    -m      - Memory region to edit:\n"
                                                      "                Address  - Starting 32-bit memory address (beginning from 0)\n"
                                                      "                Size     - Size of memory region to be edited in bytes\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To edit a file in hex mode:\n"
                                                      "    fs0:\\> hexedit test.bin\n"
                                                      "\n"
                                                      "  * To edit block device fs0 starting at block 0 with size of 2 blocks:\n"
                                                      "    fs0:\\> hexedit -d fs0 0 2\n"
                                                      "\n"  
                                                      "  * To edit memory region starting at address 0x00000000 with size of 2 bytes:\n"
                                                      "    fs0:\\> hexedit -m 0 2\n"
